In [2]:
%load_ext sql

In [3]:
%sql mysql+pymysql://root:password@localhost:3306/md_water_services

In [4]:
%%sql

SHOW TABLES FROM md_water_services;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
9 rows affected.

[('auditor_report',),
 ('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

# STEP 1
We create a new table named auditor_report

In [5]:
%%sql

#DROP TABLE IF EXISTS auditor_report;

CREATE TABLE auditor_report (
location_id VARCHAR(32),
type_of_water_source VARCHAR(64),
true_water_source_score INT DEFAULT NULL,
statements VARCHAR(255)
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.
0 rows affected.

[]

In [7]:
%%sql

SELECT * FROM md_water_services.auditor_report
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 'well', 1, "Residents admired the official's commitment to enhancing urban life, praising their cooperative and inclusive approach."),
 ('AkRu08112', 'well', 3, "Villagers spoke highly of the official's dedication and genuine interest in their lives, fostering a sense of belonging and appreciation."),
 ('AkLu02044', 'river', 0, "Villagers were touched by the official's interactions, noting their humility, strong work ethic, and respectful attitude."),
 ('AkHa00421', 'well', 3, "Villagers were moved by the official's visit, praising their hard work, humility, and the profound sense of connection they fostered."),
 ('SoRu35221', 'river', 0, "A photographer's lens captures the queue, though his own struggle for water is a hidden part of the story.")]

Now, we join the visits table to the auditor_report table. Make sure to grab subjective_quality_score, record_id and location_id.

In [14]:
%%sql
SELECT
    a.location_id AS Audit_location,
    a.true_water_source_score,
    v.location_id AS Visit_location,
    v.record_id
FROM 
    auditor_report AS a
JOIN
    visits AS v
ON a.location_id = v.location_id
LIMIT 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('SoRu34980', 1, 'SoRu34980', 5185),
 ('AkRu08112', 3, 'AkRu08112', 59367),
 ('AkLu02044', 0, 'AkLu02044', 37379),
 ('AkHa00421', 3, 'AkHa00421', 51627),
 ('SoRu35221', 0, 'SoRu35221', 28758)]

We filter the records to only include data where the employee score and auditor score are equal to zero.

In [ ]:
%%sql

SELECT
    a.location_id AS Audit_location,
    a.true_water_source_score AS Auditor_score,
    v.location_id AS Visit_location,
    v.record_id,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) = 0;

We filter the records to only include data where the employee score and auditor score are equal to zero and a visit count = 1

In [ ]:
%%sql

SELECT
    a.location_id AS Audit_location,
    a.true_water_source_score AS Auditor_score,
    v.location_id AS Visit_location,
    v.record_id,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) = 0
    AND v.visit_count = 1
LIMIT 10000;

we query our database to bring out record where both employee and auditor score are not equal to zero with a visit count up to 1

In [ ]:
%%sql

SELECT
    a.location_id AS Audit_location,
    a.true_water_source_score AS Auditor_score,
    v.location_id AS Visit_location,
    v.record_id,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) != 0
    AND v.visit_count = 1;

In [ ]:
%%sql

SELECT
    a.location_id AS Auditor_location,
    a.type_of_water_source AS Auditor_source,
    ws.type_of_water_source AS Survey_source,
    a.true_water_source_score AS Auditor_score,
    v.location_id AS Visit_location,
    v.record_id,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
JOIN
    water_source AS ws
    ON v.source_id = ws.source_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) != 0
    AND v.visit_count = 1;

In [ ]:
%%sql

SELECT
    a.location_id AS Auditor_location,
    a.type_of_water_source AS Auditor_source,
    a.true_water_source_score AS Auditor_score,
    v.location_id AS Visit_location,
    v.record_id,
    w.subjective_quality_score AS Employee_score,
    a.statements
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) != 0
    AND v.visit_count = 1
LIMIT 10;

# STEP 3. LINKING THE RECORDS

we join the employee data, so we can see which employees made these incorrect records.

In [78]:
%%sql

SELECT
    a.location_id AS Auditor_location,
    v.record_id,
    v.assigned_employee_id,
    a.true_water_source_score AS Auditor_score,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) != 0
    AND v.visit_count = 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 21160, 34, 3, 10),
 ('KiRu29290', 7938, 1, 3, 10),
 ('KiHa22748', 43140, 1, 9, 10),
 ('SoRu37841', 18495, 34, 6, 10),
 ('KiRu27884', 33931, 1, 1, 10),
 ('KiZu31170', 17950, 5, 9, 10),
 ('KiZu31370', 36864, 48, 3, 10),
 ('AkRu06495', 45924, 1, 2, 10),
 ('HaRu17528', 30524, 18, 1, 10),
 ('SoRu38331', 13192, 5, 3, 10)]

In [80]:
%%sql

SELECT
    a.location_id AS Auditor_location,
    v.record_id,
    e.employee_name,
    a.true_water_source_score AS Auditor_score,
    w.subjective_quality_score AS Employee_score
FROM 
    auditor_report AS a
JOIN
    visits AS v
    ON a.location_id = v.location_id
JOIN
    water_quality AS w
    ON v.record_id = w.record_id
JOIN
    employee AS e
    ON v.assigned_employee_id = e.assigned_employee_id
WHERE
    (a.true_water_source_score - w.subjective_quality_score) != 0
    AND v.visit_count = 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkRu05215', 21160, 'Rudo Imani', 3, 10),
 ('KiRu29290', 7938, 'Bello Azibo', 3, 10),
 ('KiHa22748', 43140, 'Bello Azibo', 9, 10),
 ('SoRu37841', 18495, 'Rudo Imani', 6, 10),
 ('KiRu27884', 33931, 'Bello Azibo', 1, 10),
 ('KiZu31170', 17950, 'Zuriel Matembo', 9, 10),
 ('KiZu31370', 36864, 'Yewande Ebele', 3, 10),
 ('AkRu06495', 45924, 'Bello Azibo', 2, 10),
 ('HaRu17528', 30524, 'Jengo Tumaini', 1, 10),
 ('SoRu38331', 13192, 'Zuriel Matembo', 3, 10)]

lets count how many mistake each employee made.

In [93]:
%%sql

WITH
    Incorrect_records AS (

        SELECT
            a.location_id AS Auditor_location,
            v.record_id,
            e.employee_name,
            a.true_water_source_score AS Auditor_score,
            w.subjective_quality_score AS Employee_score
        FROM 
            auditor_report AS a
        JOIN
            visits AS v
            ON a.location_id = v.location_id
        JOIN
            water_quality AS w
            ON v.record_id = w.record_id
        JOIN
            employee AS e
            ON v.assigned_employee_id = e.assigned_employee_id
        WHERE
            (a.true_water_source_score - w.subjective_quality_score) != 0
            AND v.visit_count = 1
    )

SELECT 
    employee_name,
    COUNT(employee_score) AS Number_of_mistakes
FROM 
    Incorrect_records
GROUP BY
    employee_name
ORDER BY
    number_of_mistakes DESC
Limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('Bello Azibo', 26),
 ('Malachi Mavuso', 21),
 ('Zuriel Matembo', 17),
 ('Lalitha Kaburi', 7),
 ('Rudo Imani', 5),
 ('Farai Nia', 4),
 ('Enitan Zuri', 4),
 ('Yewande Ebele', 3),
 ('Jengo Tumaini', 3),
 ('Makena Thabo', 3)]

# STEP 4. GATHERING EVIDENCE

In [105]:
%%sql

WITH error_count AS (
    SELECT
        e.employee_name,
        COUNT(*) AS number_of_mistakes
    FROM 
        auditor_report AS a
    JOIN
        visits AS v ON a.location_id = v.location_id
    JOIN
        water_quality AS w ON v.record_id = w.record_id
    JOIN
        employee AS e ON v.assigned_employee_id = e.assigned_employee_id
    WHERE
        (a.true_water_source_score - w.subjective_quality_score) != 0
        AND v.visit_count = 1
    GROUP BY
        e.employee_name
)
SELECT AVG(number_of_mistakes)
FROM error_count;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('6.0000'),)]

In [107]:

%%sql

WITH error_count AS (
    SELECT
        e.employee_name,
        COUNT(*) AS number_of_mistakes
    FROM 
        auditor_report AS a
    JOIN
        visits AS v ON a.location_id = v.location_id
    JOIN
        water_quality AS w ON v.record_id = w.record_id
    JOIN
        employee AS e ON v.assigned_employee_id = e.assigned_employee_id
    WHERE
        (a.true_water_source_score - w.subjective_quality_score) != 0
        AND v.visit_count = 1
    GROUP BY
        e.employee_name
)

SELECT
    employee_name,
    number_of_mistakes
FROM
    error_count
WHERE
    number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('Bello Azibo', 26),
 ('Zuriel Matembo', 17),
 ('Malachi Mavuso', 21),
 ('Lalitha Kaburi', 7)]

In [108]:
%%sql

CREATE VIEW Incorrect_records AS (
    SELECT
        a.location_id,
        v.record_id,
        e.employee_name,
        a.true_water_source_score AS auditor_score,
        w.subjective_quality_score AS employee_score,
        a.statements AS statements
    FROM
        auditor_report AS a
    JOIN
        visits AS v
    ON a.location_id = v.location_id
    JOIN
        water_quality AS w
    ON v.record_id = w.record_id
    JOIN
        employee AS e
    ON e.assigned_employee_id = v.assigned_employee_id
    WHERE
    v.visit_count =1
    AND a.true_water_source_score != w.subjective_quality_score
);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
0 rows affected.

[]

In [ ]:
%%sql
SELECT * FROM Incorrect_records;

In [114]:
%%sql
WITH error_count AS (
    SELECT
        employee_name,
        COUNT(employee_name) AS number_of_mistakes
    FROM
        Incorrect_records
    GROUP BY
        employee_name)
SELECT
    AVG(number_of_mistakes)
FROM
    error_count;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('6.0000'),)]

In [116]:
%%sql
WITH error_count AS (
    SELECT
        employee_name,
        COUNT(employee_name) AS number_of_mistakes,
    FROM
        Incorrect_records
    GROUP BY
        employee_name)

SELECT
    employee_name,
    number_of_mistakes
FROM
    error_count
WHERE
    number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
4 rows affected.

[('Bello Azibo', 26),
 ('Zuriel Matembo', 17),
 ('Malachi Mavuso', 21),
 ('Lalitha Kaburi', 7)]

In [136]:
%%sql
WITH error_count AS (
        SELECT
            employee_name, 
            COUNT(employee_name) AS number_of_mistakes
        FROM
            Incorrect_records

        GROUP BY
            employee_name),

    suspect_list AS (
        SELECT
            employee_name,
            number_of_mistakes
        FROM
            error_count
        WHERE
            number_of_mistakes > (SELECT AVG(number_of_mistakes) FROM error_count))
 

SELECT
    ir.employee_name,
    ir.location_id,
    ir.statements
FROM
    Incorrect_records AS ir
JOIN
    suspect_list AS sl ON ir.employee_name = sl.employee_name
WHERE
    ir.statements LIKE '%_cash_%';

 * mysql+pymysql://root:***@localhost:3306/md_water_services
19 rows affected.

[('Bello Azibo', 'AkRu05741', 'An air of mistrust surrounded the official, as villagers spoke of laziness and hints of corruption. The mention of cash passing discreetly only deepened their concerns.'),
 ('Bello Azibo', 'AmRu14887', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.'),
 ('Bello Azibo', 'KiMr24919', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Bello Azibo', 'KiRu29639', "An unsettling atmosphere prevailed as villagers shared stories of an official's arrogance and perceived corruption. The mention of cash exchanges only intensified their concerns."),
 ('Bello Azibo', 'AkRu04508', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Bello Azibo', 'KiRu27065', 'Villagers expressed their discomfort with an official who displayed a haughty demeanor and negligence. The mention of cash transactions deepened their growing sense of unease.'),
 ('Bello Azibo', 'HaSe21323', 'Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.'),
 ('Bello Azibo', 'KiIs23853', "Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The mention of cash changing hands further tainted their perception."),
 ('Zuriel Matembo', 'HaRu20146', "An air of mistrust hung heavy as villagers described an official's aloof behavior and potential impropriety. The whisper of cash exchanges only fueled their apprehension."),
 ('Zuriel Matembo', 'HaSe20888', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Zuriel Matembo', 'SoIl32575', 'Villagers recounted unsettling encounters with an official known for their arrogance and avoidance of responsibilities. The mention of cash changing hands added to their apprehension and distrust.'),
 ('Zuriel Matembo', 'AkRu05880', "Villagers' wary accounts of an official's arrogance and detachment from their concerns raised suspicions. The allusion to cash changing hands deepened their skepticism."),
 ('Zuriel Matembo', 'SoRu38331', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Malachi Mavuso', 'AmAm09956', 'An unsettling atmosphere surrounded the official, as villagers shared their experiences of arrogance and lack of dedication. The mention of cash exchanges only intensified their doubts.'),
 ('Malachi Mavuso', 'AmRu15719', "Suspicion and unease colored the villagers' accounts of an official's haughty behavior and potential corruption. The mention of cash changing hands added to their apprehension."),
 ('Malachi Mavuso', 'KiRu25347', 'Villagers expressed their discontent with an official who appeared dismissive and neglectful. The mention of cash changing hands added to their growing sense of distrust.'),
 ('Malachi Mavuso', 'AmAm09607', 'Villagers spoke of an unsettling encounter with an official who appeared dismissive and detached. The reference to cash transactions added to their growing sense of distrust.'),
 ('Lalitha Kaburi', 'KiRu29329', "Suspicion colored villagers' descriptions of an official's aloof demeanor and apparent laziness. The reference to cash transactions cast doubt on their motives."),
 ('Lalitha Kaburi', 'AkRu07310', 'Villagers spoke of their unsettling encounters with an official who seemed indifferent and uninterested, hinting at potential improprieties involving cash exchanges.')]